Revit 2024 API
MEPAnalyticalModelData.IsValidNodeId Method
 Verifies if a valid analytical node id.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool IsValidNodeId(
	int nodeId
)
Visual Basic
Public Function IsValidNodeId ( _
	nodeId As Integer _
) As Boolean
Visual C++
public:
bool IsValidNodeId(
	int nodeId
)
Parameters
nodeId
Type: System.Int32
 The node id to be verified.
Return Value
 True if valid, otherwise false.
See Also
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace